_Rarzrabotki/Rarus/USO2/DataProcessors/уатПомощникПланированияРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатПомощникПланированияРаботыТС</Name>
			<Comment>Помощник планирования работы ТС</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СоставПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетализацияПланирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Comment>Договор</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Comment>Маршрут</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатДетализацияПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатДетализацияПланирования</Name>
			<Comment>Детализация планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатРазделыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатРазделыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоПЛ</Name>
					<Comment>Выработка ТС по путевым листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныеУслуги</Name>
					<Comment>Предоставленные услуги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатПомощникПланированияРаботыТС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
		Возврат;
	КонецЕсли;

	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Сценарий") Тогда
		Сценарий = Параметры.Сценарий;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение = Параметры.Подразделение;
	КонецЕсли;
	Если Параметры.Свойство("ДатаНач") Тогда
		НачалоПериода = Параметры.ДатаНач;
		уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(НачалоПериода, Сценарий.Периодичность);
		НачалоПериода = НачалоПериода - 1;
		уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(НачалоПериода, Сценарий.Периодичность);
	КонецЕсли;
	Если Параметры.Свойство("ДатаКон") Тогда
		КонецПериода = Параметры.ДатаКон;
		уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(КонецПериода, Сценарий.Периодичность);
		КонецПериода = КонецПериода - 1;
	КонецЕсли;
	Если Параметры.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = Параметры.СуммаВключаетНДС;
	КонецЕсли;
	Если Параметры.Свойство("УчитыватьНДС") Тогда
		УчитыватьНДС = Параметры.УчитыватьНДС;
	КонецЕсли;
	
	СкорректироватьПериодЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если АвтоТест Тогда
		Возврат;
	КонецЕсли;
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("en='This data processor is only called from the document ""Planning of vehicle work""';ru='Данная обработка вызывается только из документа ""Планирование работы ТС""'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР, 10);
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ФорматироватьКолонкуДетализации();
	УстановитьВидимостьДоступность();
	ОбновитьПараметрВыработкиВременный();
	
	ИнициализацияКомпоновщика();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ПеренестиВДокумент И Объект.СоставПлана.Количество() > 0 Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Таблица плана содержит строки. Перенести в документ?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.СоставПлана.Очистить();
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокументИЗакрыть();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ПеренестиВДокументИЗакрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураСтрокиСостава()
	СтруктураСтроки = Новый Структура;
	Для Каждого ТекПоле Из Метаданные.Обработки.уатПомощникПланированияРаботыТС.ТабличныеЧасти.СоставПлана.Реквизиты Цикл
		СтруктураСтроки.Вставить(ТекПоле.Имя);
	КонецЦикла;
	
	Возврат СтруктураСтроки;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСоставПлана(Команда)
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан сценарий!");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указана организация!");
		Возврат;
	КонецЕсли;
	
	флОчищать = Ложь;
	Если Объект.СоставПлана.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Tabular section is not empty! Clear?';ru='Таблица содержит строки! Продолжить с очисткой?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьСоставПланаЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьСоставПланаФрагмент(флОчищать);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставПланаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	флОчищать = Ложь;
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
        флОчищать = Истина;
    КонецЕсли;
    
    ЗаполнитьСоставПланаФрагмент(флОчищать);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставПланаФрагмент(Знач флОчищать)
    
    ЗаполнитьСоставПланаСервер(флОчищать);
    ОбновитьВсегоВТЧ();
    ОбновитьПараметрВыработкиВременный();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСоставПлана(Команда)
	Если Объект.СоставПлана.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНСТР = НСтр("en='Structure of plan will be cleared! Continue?';ru='Таблица будет очищена! Продолжить?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьСоставПланаЗавершение", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСоставПланаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.ОК Тогда
        Объект.СоставПлана.Очистить();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	ПроизвольныйПериод               = Новый СтандартныйПериод;
	ПроизвольныйПериод.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПроизвольныйПериод.ДатаНачала    = НачалоПериода;
	ПроизвольныйПериод.ДатаОкончания = КонецПериода;

	ДиалогВыбораПериода        = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период = ПроизвольныйПериод;
	
	ДиалогВыбораПериода.Показать(Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Если Период <> Неопределено Тогда
        НачалоПериода = Период.ДатаНачала;
		уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(НачалоПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
        КонецПериода = Период.ДатаОкончания;
		уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоКонцуПериода(КонецПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредыдущийПериод(Команда)
	НачалоПериода = НачалоПериода - 1;
	КонецПериода = НачалоПериода;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачалоПериода, КонецПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСледующийПериод(Команда)
	КонецПериода = КонецДня(КонецПериода) + 1;
	НачалоПериода = КонецПериода;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачалоПериода, КонецПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	#Если ВебКлиент Тогда
		ТекстНСТР = НСтр("en='Export to Excel is not available in the Web client.';ru='Выгрузка в Excel недоступна в Web-клиенте.'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		//ВыполнитьВыгрузкуЗавершениеФрагмент();
	#КонецЕсли
	
	ДиалогВыбораФайла                             = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.Фильтр                      = НСтр("en='Data file';ru='Файл данных'") + " (*.xls)|*.xls";
	ДиалогВыбораФайла.Заголовок                   = НСтр("en='Select file';ru='Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xls";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.МножественныйВыбор          = Ложь;
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыполнитьВыгрузкуЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда 
        Возврат;
    КонецЕсли;
	
	ФайлВыгрузки = ВыбранныеФайлы[0];
    
	Если ПустаяСтрока(ФайлВыгрузки) Тогда
		ТекстОшибки = НСтр("en='It is necessary to specify the upload file.';ru='Необходимо указать файл выгрузки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыполнитьВыгрузкуЗавершениеФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуЗавершениеФрагмент()
    
    Перем ДанныеХранилища;
	
	ВыполнитьВыгрузкуExcelНаСервере();
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресХранилищаФайлВыгрузки);
		
	#Если НЕ ВебКлиент Тогда
		ДанныеХранилища.Записать(ФайлВыгрузки);
		НачатьЗапускПриложения(Новый ОписаниеОповещения("Подключаемый_ОписаниеОповещенияЗапускExcel", ЭтотОбъект), ФайлВыгрузки);
	#Иначе
		ПолучитьФайл(АдресХранилищаФайлВыгрузки, "План работы ТС.xls");
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОписаниеОповещенияЗапускExcel(Рез, ДопПараметры) Экспорт
	ПочемуНекорректноеОписаниеМетодаНачатьЗапускПриложения = Истина;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуExcelНаСервере()
	УникальныйИД                   = Новый УникальныйИдентификатор;
	ИмяВременногоФайлаОбмена       = КаталогВременныхФайлов() + УникальныйИД + "_VehicleWorkPlan.xls";
	
	//сформировать табл. документ
	ТабДок = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ФайлВыгрузкиExcel");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		//ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
		ОбластьСтрока.Параметры.ДетализацияПланирования = ТекСтрока.ДетализацияПланирования.Наименование;
		ОбластьСтрока.Параметры.ПараметрВыработки = ТекСтрока.ПараметрВыработки.Наименование;
		ОбластьСтрока.Параметры.Услуга = ТекСтрока.Номенклатура.Наименование;
		ОбластьСтрока.Параметры.Контрагент = ТекСтрока.Контрагент.Наименование;
		ОбластьСтрока.Параметры.Договор = ТекСтрока.Договор.Наименование;
		ОбластьСтрока.Параметры.Маршрут = ТекСтрока.Маршрут.Наименование;
		ОбластьСтрока.Параметры.ОбъектСтроительства = ТекСтрока.ОбъектСтроительства.Наименование;
		ОбластьСтрока.Параметры.ВидПеревозки = ТекСтрока.ВидПеревозки.Наименование;
		ОбластьСтрока.Параметры.СтавкаНДС = Строка(ТекСтрока.СтавкаНДС);
		ОбластьСтрока.Параметры.Количество = ТекСтрока.Количество;
		ОбластьСтрока.Параметры.Цена = ТекСтрока.Цена;
		ОбластьСтрока.Параметры.Сумма = ТекСтрока.Сумма;
		ОбластьСтрока.Параметры.СуммаНДС = ТекСтрока.СуммаНДС;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ТабДок.Записать(ИмяВременногоФайлаОбмена, ТипФайлаТабличногоДокумента.XLS);
	
	АдресХранилищаФайлВыгрузки = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена), УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	#Если ВебКлиент Тогда
		ТекстНСТР = НСтр("en='Import from Excel is not available in Web client.';ru='Загрузка из Excel недоступна в Web-клиенте.'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	#КонецЕсли
	
	Если Сценарий.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "Для загрузки из файла EXCEL необходимо указать сценарий!");
		Возврат;
	КонецЕсли;
		
	флОчищать = Ложь;
	Если Объект.СоставПлана.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Tabular section is not empty! Clear?';ru='Таблица содержит строки! Продолжить с очисткой?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьИзExcelВопрос", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзExcelВыборФайла();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СоставПлана.Очистить();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзExcelВыборФайла();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcelВыборФайла()
	ДиалогВыбораФайла                             = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("en='Data file';ru='Файл данных'") + " (*.xls)|*.xls";
	ДиалогВыбораФайла.Заголовок                   = НСтр("en='Select file';ru='Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xls";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.МножественныйВыбор          = Ложь;
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыполнитьЗагрузкуЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда 
        Возврат;
    КонецЕсли;
	
	ФайлВыгрузки = ВыбранныеФайлы[0];
    
	Если ПустаяСтрока(ФайлВыгрузки) Тогда
		ТекстОшибки = НСтр("en='It is necessary to specify the download file.';ru='Необходимо указать файл загрузки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗагрузкуExcelНаКлиенте();
	ОбновитьВсегоВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуExcelНаКлиенте()
	Попытка
		НашФайл = ПолучитьCOMОбъект(ФайлВыгрузки);
	Исключение
		СтрокаОшибки = ИнформацияОбОшибке().Описание + ?(ИнформацияОбОшибке().Причина = Неопределено, "", " " + НСтр("en='by reason:';ru='по причине:'") + " "
			+ ИнформацияОбОшибке().Причина.Описание + " (" + НСтр("en='perhaps MS Excel not installed!';ru='возможно, не установлен MS Excel!'") +")");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		Возврат;
	КонецПопытки;
	
	ДетПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "ДетализацияПланирования");
	Если ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТипТС") Тогда
		ТипДетализации = Тип("СправочникСсылка.ТипыТранспортныхСредств");
	ИначеЕсли ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.МодельТС") Тогда
		ТипДетализации = Тип("СправочникСсылка.уатМоделиТС");
	Иначе
		ТипДетализации = Тип("СправочникСсылка.ТранспортныеСредства");
	КонецЕсли;
	
	флПланированиеУслуг = (уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Раздел") = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги"));
		
	НашЛист = НашФайл.WorkSheets.Item(1);
	ПослСтр = НашЛист.Cells(1,1).SpecialCells(11).Row;
	
	Для Сч = 2 По ПослСтр Цикл
		НоваяСтрока = Объект.СоставПлана.Добавить();
		НоваяСтрока.ДетализацияПланирования	= НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 1).Value, ТипДетализации);
		НоваяСтрока.ПараметрВыработки = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 2).Value, Тип("СправочникСсылка.уатПараметрыВыработки"));
		НоваяСтрока.Контрагент = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 4).Value, Тип("СправочникСсылка.Контрагенты"));
		НоваяСтрока.Маршрут = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 6).Value, Тип("СправочникСсылка.уатМаршруты"));
		НоваяСтрока.ОбъектСтроительства = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 7).Value, Тип("СправочникСсылка.СМ_ОбъектыСтроительства"));
		НоваяСтрока.ВидПеревозки = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 8).Value, Тип("СправочникСсылка.уатВидыПеревозок"));
		
		КоличествоФайл = НашЛист.Cells(Сч, 9).Value;
		НоваяСтрока.Количество = ?(КоличествоФайл = Неопределено, 0, Число(КоличествоФайл));
		
		Если флПланированиеУслуг Тогда
			НоваяСтрока.Номенклатура = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 3).Value, Тип("СправочникСсылка.Номенклатура"));
			НоваяСтрока.Договор = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 5).Value, Тип("СправочникСсылка.ДоговорыКонтрагентов"));
			ЦенаФайл = НашЛист.Cells(Сч, 10).Value;
			НоваяСтрока.Цена = ?(ЦенаФайл = Неопределено, 0, Число(ЦенаФайл));
			СуммаФайл = НашЛист.Cells(Сч, 11).Value;
			НоваяСтрока.Сумма = ?(СуммаФайл = Неопределено, 0, Число(СуммаФайл));
			Если УчитыватьНДС Тогда
				НоваяСтрока.СтавкаНДС = НайтиСсылкуПоПредставлению(НашЛист.Cells(Сч, 12).Value, Тип("ПеречислениеСсылка.СтавкиНДС"));
				СуммаНДСФайл = НашЛист.Cells(Сч, 13).Value;
				НоваяСтрока.СуммаНДС = ?(СуммаНДСФайл = Неопределено, 0, Число(СуммаНДСФайл));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСсылкуПоПредставлению(Представление, ТипОбъекта)
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектМет = Метаданные.НайтиПоТипу(ТипОбъекта);
	Если Метаданные.Справочники.Найти(ОбъектМет.Имя) <> Неопределено Тогда //справочник
		Возврат Справочники[ОбъектМет.Имя].НайтиПоНаименованию(Представление);
	Иначе //перечисление
		Для Каждого ТекЗначениеПеречисления Из Метаданные.Перечисления[ОбъектМет.Имя].ЗначенияПеречисления Цикл
			Возврат Перечисления[ОбъектМет.Имя][ТекЗначениеПеречисления.Имя]
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОкруглитьЦены(Команда)
	ПараметрыОткрытия = Новый Структура("ТолькоОкругление, СтарыеЦены", Истина, Ложь);
	
	ОткрытьФорму("Обработка.уатРедактированиеТарифов_уэ.Форма.ПараметрыОкругления", ПараметрыОткрытия, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ИзменитьОкруглитьНаПроцентЗавершение", ЭтотОбъект, ПараметрыОткрытия), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНаПроцент(Команда)
	ПараметрыОткрытия = Новый Структура("ТолькоОкругление, СтарыеЦены", Ложь, Ложь);
	
	ОткрытьФорму("Обработка.уатРедактированиеТарифов_уэ.Форма.ПараметрыИзмененияОкругления", ПараметрыОткрытия, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ИзменитьОкруглитьНаПроцентЗавершение", ЭтотОбъект, ПараметрыОткрытия), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОкруглитьНаПроцентЗавершение(ПараметрыРасчета, ДополнительныеПараметры) Экспорт
	Если ПараметрыРасчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	флИзменение = (НЕ ДополнительныеПараметры.ТолькоОкругление И ПараметрыРасчета.ПроцентИзменения <> 0);
	флОкругление = (ДополнительныеПараметры.ТолькоОкругление ИЛИ ПараметрыРасчета.Округлять);
	
	Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
		Если флИзменение Тогда
			ТекСтрока.Цена = ТекСтрока.Цена * (1 + ПараметрыРасчета.ПроцентИзменения/100);
		КонецЕсли;
		Если флОкругление Тогда
			ТекСтрока.Цена = ОкруглитьЦену(ТекСтрока.Цена, ПараметрыРасчета.ТочностьОкругления, ПараметрыРасчета.РежимОкругления);
		КонецЕсли;
		Если флИзменение ИЛИ флОкругление Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ОкруглитьЦену(Число, ТочностьОкругления, РежимОкругленияТарифа)
	Перем Результат;
		
	// вычислим количество интервалов, входящих в число
	Если ТочностьОкругления <> 0 Тогда
		КоличествоИнтервалов = Число / ТочностьОкругления;
	Иначе
		КоличествоИнтервалов = 0;
	КонецЕсли;
		
	// вычислим целое количество интервалов.
	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервалов);
		
	Если КоличествоИнтервалов = КоличествоЦелыхИнтервалов Тогда
		// Числа поделились нацело. Округлять не нужно.
		Результат = Число;
	Иначе
		Если РежимОкругленияТарифа = 0 Тогда
			// по арифметическим правилам
			// При точности округления "0.1" 0.35 должно округлится до 0.4,
			// а 0.34 до 0.3
			Результат = ТочностьОкругления * Окр(КоличествоИнтервалов, 0, РежимОкругления.Окр15как20);
			
		ИначеЕсли РежимОкругленияТарифа = 1 Тогда
			// в большую сторону
			// При точности округления "0.1" 0.35 должно округлится до 0.4, а -0.35 до -0.3
			Если КоличествоЦелыхИнтервалов > 0 Тогда
				Результат = ТочностьОкругления * (КоличествоЦелыхИнтервалов + 1);
			Иначе
				Результат = ТочностьОкругления * КоличествоЦелыхИнтервалов;
			КонецЕсли;
		Иначе
			// в меньшую сторону
			// При точности округления "0.1" 0.35 должно округлится до 0.3, а -0.35 до -0.4
			Если КоличествоЦелыхИнтервалов > 0 Тогда
				Результат = ТочностьОкругления * КоличествоЦелыхИнтервалов;
			Иначе
				Результат = ТочностьОкругления * (КоличествоЦелыхИнтервалов - 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ОкруглитьЦену()

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	СкорректироватьПериодЗаполнения();
	ФорматироватьКолонкуДетализации();
	ИнициализацияКомпоновщика();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(НачалоПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоКонцуПериода(КонецПериода, уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Периодичность"));
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗаполненияПриИзменении(Элемент)
	ИнициализацияКомпоновщика();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ЗначениеЗаполнено(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "ДетализацияПланирования")) Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("en='Details of planning in script are not specified"
			"or script is not filled!';ru='Не указана детализация планирования у сценария"
			"или не заполнен сценарий!'");
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СоставПланаПередНачаломДобавленияЗавершение", ЭтотОбъект), ТекстНСТР, 10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПередНачаломДобавленияЗавершение(ДополнительныеПараметры) Экспорт
	Заглушка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.СоставПлана.ТекущиеДанные;
	Если НоваяСтрока И НЕ ЗначениеЗаполнено(ТекСтрока.ДетализацияПланирования) Тогда
		ДетПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "ДетализацияПланирования");
		Если ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.МодельТС") Тогда
			ТекСтрока.ДетализацияПланирования = ПредопределенноеЗначение("Справочник.уатМоделиТС.ПустаяСсылка");
		ИначеЕсли ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТипТС") Тогда
			ТекСтрока.ДетализацияПланирования = ПредопределенноеЗначение("Справочник.ТипыТранспортныхСредств.ПустаяСсылка");
		ИначеЕсли ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТС") Тогда
			ТекСтрока.ДетализацияПланирования = ПредопределенноеЗначение("Справочник.ТранспортныеСредства.ПустаяСсылка");
		Иначе
			ТекСтрока.ДетализацияПланирования = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПараметрВыработкиВременный Тогда
		Элементы.СоставПланаКоличество.ФорматРедактирования = "ЧДЦ=2; ЧРД=:";
	Иначе
		Элементы.СоставПланаКоличество.ФорматРедактирования = "";
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Если УчитыватьНДС И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Раздел") = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
			ТекСтрока.СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьВсегоВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПараметрВыработкиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
		
	ОбновитьПараметрВыработкиВременный();
	
	Если СтрокаТабличнойЧасти.ПараметрВыработкиВременный Тогда
		Элементы.СоставПланаКоличество.ФорматРедактирования = "ЧДЦ=2; ЧРД=:";
	Иначе
		Элементы.СоставПланаКоличество.ФорматРедактирования = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораГруза(Элемент, Элементы.СоставПлана.ТекущиеДанные.Номенклатура, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.СоставПлана.ТекущиеДанные;
	Если ТекСтрока.ПараметрВыработкиВременный Тогда
		уатЗащищенныеФункцииСервер.КонтрольВводаВремени(ТекСтрока.Количество);
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСуммаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСтавкаНДСПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСоставПланаСервер(флОчищать)
	Если флОчищать Тогда
		Объект.СоставПлана.Очистить();
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	//установка параметров
	СхемаКомпоновкиДанных.Параметры.Организация.Значение = Организация;
	СхемаКомпоновкиДанных.Параметры.ДатаНач.Значение = НачалоДня(НачалоПериода);
	СхемаКомпоновкиДанных.Параметры.ДатаКон.Значение = КонецДня(КонецПериода);
	Если ВариантЗаполнения = 1 Тогда //источник данных - план ТС
		СхемаКомпоновкиДанных.Параметры.Сценарий.Значение = Сценарий;
	Иначе
		СхемаКомпоновкиДанных.Параметры.Детализация.Значение = Сценарий.ДетализацияПланирования;
		Если Сценарий.Раздел = Перечисления.уатРазделыПланирования.ПредоставленныеУслуги Тогда
			СхемаКомпоновкиДанных.Параметры.ПланированиеПоГруппамУслуг.Значение = Сценарий.ПланированиеПоГруппамУслуг;
			СхемаКомпоновкиДанных.Параметры.Валюта.Значение = Сценарий.Валюта;
		Иначе
			СхемаКомпоновкиДанных.Параметры.Подразделение.Значение = Подразделение;
		КонецЕсли;
	КонецЕсли;
	
	//компоновка - получение данных
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиКомпоновки = КомпоновщикОтбор.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	тблЗапросДанные = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(тблЗапросДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ВариантЗаполнения = 1 Тогда //план
		Если УчитыватьНДС Тогда
			тблЗапросДанные.Свернуть("ДетализацияПланирования, Контрагент, Договор, Маршрут, ОбъектСтроительства, ВидПеревозки, Номенклатура, ПараметрВыработки", "Количество, Сумма, СуммаНДС");
		Иначе
			тблЗапросДанные.Свернуть("ДетализацияПланирования, Контрагент, Договор, Маршрут, ОбъектСтроительства, ВидПеревозки, Номенклатура, ПараметрВыработки", "Количество, Сумма");
		КонецЕсли;
	ИначеЕсли Сценарий.Раздел = Перечисления.уатРазделыПланирования.ПредоставленныеУслуги Тогда //услуги
		Если УчитыватьНДС Тогда
			тблЗапросДанные.Свернуть("ДетализацияПланирования, Контрагент, Договор, Маршрут, ОбъектСтроительства, ВидПеревозки, Номенклатура, ПараметрВыработки, СтавкаНДС", "Количество, Сумма, СуммаНДС");
		Иначе
			тблЗапросДанные.Свернуть("ДетализацияПланирования, Контрагент, Договор, Маршрут, ОбъектСтроительства, ВидПеревозки, Номенклатура, ПараметрВыработки", "Количество, Сумма");
		КонецЕсли;
	Иначе //выработка
		тблЗапросДанные.Свернуть("ДетализацияПланирования, Контрагент, Маршрут, ОбъектСтроительства, ВидПеревозки, ПараметрВыработки", "Количество");
	КонецЕсли;
		
	Для Каждого ТекСтрока Из тблЗапросДанные Цикл
		НоваяСтрока = Объект.СоставПлана.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Если ТекСтрока.ПараметрВыработки.Временный Тогда
			НоваяСтрока.Количество = НоваяСтрока.Количество / 3600;
		КонецЕсли;
		Если НоваяСтрока.Количество > 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	РазделСценария = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "Раздел");
	флПланированиеУслуг = (РазделСценария = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги"));
	флПланированиеВыработки = (РазделСценария = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ВыработкаТСпоПЛ"));
		
	Элементы.СоставПланаНоменклатура.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаЦена.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаСумма.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаСтавкаНДС.Видимость = флПланированиеУслуг И УчитыватьНДС;
	Элементы.СоставПланаСуммаНДС.Видимость = флПланированиеУслуг И УчитыватьНДС;
	Элементы.СоставПланаВсего.Видимость = флПланированиеУслуг И УчитыватьНДС;
	
	Элементы.Подразделение.Видимость = НЕ флПланированиеУслуг;
	
	Элементы.ГруппаСоставПлана.Заголовок = ?(флПланированиеУслуг, "Услуги", "Выработка");
	Элементы.ГруппаИзменитьЦены.Видимость = флПланированиеУслуг;
	
	Если ВариантЗаполнения = 1 Тогда
		НадписьИсточникДанных = "Регистр накопления ""План работы ТС""";
	ИначеЕсли флПланированиеУслуг Тогда
		НадписьИсточникДанных = "Регистр накопления ""Выработка трансп. работы по стоимости""";
	Иначе
		НадписьИсточникДанных = "Регистр накопления ""Выработка ТС""";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрВыработкиВременный()
	Для Каждого ТекСтрокаТЧ Из Объект.СоставПлана Цикл
		ТекСтрокаТЧ.ПараметрВыработкиВременный = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрокаТЧ.ПараметрВыработки, "Временный");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсегоВТЧ()
	Для Каждого СтрокаТабличнойЧасти Из Объект.СоставПлана Цикл
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФорматироватьКолонкуДетализации()
	ДетПланир = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Сценарий, "ДетализацияПланирования");
	
	Если ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.МодельТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle model';ru='Модель ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМоделиТС");
	ИначеЕсли ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТипТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle type';ru='Тип ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыТранспортныхСредств");
	ИначеЕсли ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle';ru='ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	Иначе
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Detail';ru='Детализация'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
	КонецЕсли;
КонецПроцедуры

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.ПараметрВыработкиВременный Тогда
		Колич = Цел(СтрокаТабличнойЧасти.Количество) + (СтрокаТабличнойЧасти.Количество - Цел(СтрокаТабличнойЧасти.Количество))/60*100;
	Иначе
		Колич = СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	СтрокаТабличнойЧасти.Сумма = Колич * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Рассчитывается сумма НДС в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС, 
	СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
	СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаСервере
Процедура СкорректироватьПериодЗаполнения()
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачалоПериода, КонецПериода, Сценарий.Периодичность);
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКомпоновщика()
	Если ВариантЗаполнения = 1 Тогда
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхПлан");
		СхемаКомпоновкиДанныхОтбор = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхОтборПлан");
	ИначеЕсли Сценарий.Раздел = Перечисления.уатРазделыПланирования.ПредоставленныеУслуги Тогда
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхУслуги");
		СхемаКомпоновкиДанныхОтбор = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхОтборУслуги");
	Иначе
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхВыработка");
		СхемаКомпоновкиДанныхОтбор = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КомпоновкаДанныхОтборВыработка");
	КонецЕсли;
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	АдресСхемыКомпоновкиДанныхОтбор = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхОтбор, УникальныйИдентификатор);
	
	КомпоновщикОтбор.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанныхОтбор));
	КомпоновщикОтбор.ЗагрузитьНастройки(СхемаКомпоновкиДанныхОтбор.НастройкиПоУмолчанию);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументИЗакрыть()
	мсвСтрок = Новый Массив;
	Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
		СтруктураСтроки = СтруктураСтрокиСостава();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
		мсвСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ПеренестиВДокумент = Истина;
	Закрыть(мсвСтрок);
КонецПроцедуры

#КонецОбласти
